[
    {
        "name": "OLIVE LICENCING ENTITY LTD",
        "url": " http://www.olive.com.au/ ",
        "content": "In a Nutshell There are 3 mains pillars that form our investment strategy. 01. Wholesome Investment Wholesome investing to us, means we only invest in projects and businesses that have a positive impact on Australian society. 02. Simple & Approachable At Olive we are committed to making our investment journey as simple and effective as possible. 03. Competitive Returns We’re committed to investing in projects that are compliant with our wholesome investment strategy but are also capable of outperforming our expectations. Why invest in healthcare? The healthcare sector continues to demonstrate solid cash generation, high margins and low cyclicality. As our population continues to age, the amount of spending in the healthcare sector continues to increase year on year. Our Team Wholesome Investments. +61 2 9791 0039\ninfo@olive.com.au \nSuite 5 Level 1.\n402-410 Chapel Rd\nBankstown 2200 NSW\n"
    },
    {
        "name": "Social Impact Funds Management Pty Ltd ",
        "url": " https://socialimpactfunds.com.au/ ",
        "content": ""
    },
    {
        "name": "TWYNAM FUNDS MANAGEMENT PTY LTD",
        "url": " https://www.twynam.com/",
        "content": "Building a sustainable planet From our humble beginnings in agriculture, Twynam is now pioneering a new way of doing business. One that works for the planet, not against it.    We invest in cutting-edge startups driving a decarbonisation revolution. We also operate a sustainable farming and property portfolio.  The earth is our collective home; We are borrowing her from future generations. Proudly family-owned and spearheaded by Johnny Kahlbetzer, the Twynam Group is embracing a new chapter as a dynamic, visionary, and innovative environmental investment company transforming how the world manages its resources.    From a small farm in Australia over 50 years ago, Twynam has grown into a diversified investment group with interests in agriculture, property, and climate tech investments.  ​ As we continue to evolve, our mission remains the same: to create long-term, sustainable value while making a positive impact on our people and planet. T. +61 2 9325 9000   E. mail@twynam.com Thanks for submitting! Twynam Funds Management Pty Ltd ACN 665 482 119 (Twynam Funds Management) is a corporate authorised representative (CAR) (CAR Number 1302016) of Boutique Capital Pty Ltd ACN 621 697 621 (Boutique Capital) AFSL 508011.  ​ Any information or advice is general advice only and has been prepared by Twynam Funds Management for individuals identified as wholesale investors for the purposes of providing a financial product or financial service, under Section 761G or Section 761GA of the Corporations Act 2001 (Cth). Any information or advice given does not take into account your particular objectives, financial situation or needs and before acting on the advice, you should consider the appropriateness of the advice, having regard to your objectives, financial situation and needs. If any advice relates to the acquisition, or possible acquisition, of a particular financial product you should read any relevant Product Disclosure Statement or like instrument. 226 - 228 Liverpool Street,\nDarlinghurst, NSW, 2010 Australia T. +61 2 9325 9000   E. mail@twynam.com Website Terms Privacy Policy Copyright ​ Complaints © 2024 by Twynam Investments. "
    },
    {
        "name": "OLIVE LICENCING ENTITY LTD",
        "url": "http://www.olive.com.au/",
        "date": "2024-06-04",
        "content": "In a Nutshell There are 3 mains pillars that form our investment strategy. 01. Wholesome Investment Wholesome investing to us, means we only invest in projects and businesses that have a positive impact on Australian society. 02. Simple & Approachable At Olive we are committed to making our investment journey as simple and effective as possible. 03. Competitive Returns We’re committed to investing in projects that are compliant with our wholesome investment strategy but are also capable of outperforming our expectations. Why invest in healthcare? The healthcare sector continues to demonstrate solid cash generation, high margins and low cyclicality. As our population continues to age, the amount of spending in the healthcare sector continues to increase year on year. Our Team Wholesome Investments. +61 2 9791 0039\ninfo@olive.com.au \nSuite 5 Level 1.\n402-410 Chapel Rd\nBankstown 2200 NSW\n"
    }
]